package com.venger.hw4;

/*
Вам дана сетка row x col, представляющая карту, где grid [i] [j] = 1 представляет землю, а grid [i] [j] = 0 - воду.
Ячейки сетки соединяются по горизонтали / вертикали (не по диагонали). Сетка полностью окружена водой,
и есть ровно один остров (то есть одна или несколько связанных сухопутных ячеек).
На острове нет «озер», то есть вода внутри не связана с водой вокруг острова. Одна ячейка представляет собой квадрат со стороной 1.
Сетка прямоугольная, ширина и высота не превышают 100. Определите периметр острова.
 */

public class IslandPerimeter {

}